backend/app/controllers/recipes_controller.rb

    def show
        recipe = Recipe.find_by(id: params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
        recipe = Recipe.new(recipe_params)
        users = User.all
        recipe.save
---
INSERT INTO "recipes" ("title", "ingredients", "directions", "status", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", ""], ["ingredients", ""], ["directions", ""], ["status", "Incomplete"], ["user_id", 5], ["created_at", "2021-01-25 17:59:48.335416"], ["updated_at", "2021-01-25 17:59:48.335416"]]

    def update
        recipe = Recipe.find_by(id: params[:id])
        recipe.update(recipe_params)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "recipes" SET "status" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["status", "Liked!"], ["updated_at", "2021-01-28 18:12:00.069882"], ["id", 10]]

    def destroy
        recipe = Recipe.find(params[:id])
        recipe.destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 1]]