backend/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Adam"], ["created_at", "2021-01-24 23:13:00.580591"], ["updated_at", "2021-01-24 23:13:00.580591"]]